/*
1.
5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
A选手说：B第二，我第三；
B选手说：我第二，E第四；
C选手说：我第一，D第二；
D选手说：C最后，我第三；
E选手说：我第四，A第一；
比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。*/
//解题步骤： 
//1.根据题目，在不筛选的情况下每个人都有五种可能，所以第一步先展现出这五种可能，常用for循环
//2.所有可能情况列出后，就要对这些情况进行筛选，常用if语句

/*
#include <stdio.h>
#include <stdlib.h>
int main()
{
	int a = 0;
	int b = 0;
	int c = 0;
	int d = 0;
	int e = 0;
	for (a = 1; a <= 5; a++)
	for (b = 1; b <= 5; b++)
	for (c = 1; c <= 5; c++)
	for (d = 1; d <= 5; d++)
	for (e = 1; e <= 5; e++)
	{
		if (((b == 1) + (a == 3) == 1) &&
			((b == 2) + (e == 4) == 1) &&
			((c == 1) + (d == 2) == 1) &&
			((c == 5) + (d == 3) == 1) &&
			((e == 4) + (a == 1) == 1) == 1)
		{
			printf("a=%d b=%d c=%d d=%d e=%d \n", a, b, c, d, e);
		}
	}

	system("pause");
	return 0;
}
*/
//从结果来看，a,b,c,d,e,中有重复值，这与题目要求不符合，说明步骤二的筛选的不够全面，缺少5个值不同的判断，所以再进行一步判断
/*#include<stdio.h>
int main()
{
	int a = 0, b = 0, c = 0, d = 0, e = 0;
	for (a = 1; a <= 5; a++)
	{
		for (b = 1; b <= 5; b++)
		{
			for (c = 1; c <= 5; c++)
			{
				for (d = 1; d <= 5; d++)
				{
					for (e = 1; e <= 5; e++)
					{

						if ((2 == b && 3 != a) || (2 != b && 3 == a) == 1)
						{
							if ((2 == b && 4 != e) || (2 != b && 4 == e) == 1)
							{
								if ((1 == c && 2 != d) || (1 != c && 2 == d) == 1)
								{
									if ((5 == c && 3 != d) || (5 != c && 3 == d) == 1)
									{
										if ((4 == e && 1 != a) || (4 != e && 1 == a) == 1)
										{//对五个值均不相同的判断
											if (((a != b) && (a != c) && (a != d) && (a != e))
												&& ((b != c) && (b != d) && (b != e))
												&& ((c != d) && (c != e))
												&& ((d != e)))
											{
												printf("a= %d, b= %d,c= %d,d= %d,e= %d\n", a, b, c, d, e);
											}

										}
									}
								}
							}
						}
					}
				}
			}
		}
	}

	return 0;
}
*/


/*
2.
日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个
嫌疑犯的一个。以下为4个嫌疑犯的供词。
A说：不是我。
B说：是C。
C说：是D。
D说：C在胡说
已知3个人说了真话，1个人说的是假话。
现在请根据这些信息，写一个程序来确定到底谁是凶手。
解析：
    首先，分析一下题目，嫌疑犯必定为A,B,C,D中其中的一人，因此我们可以定义一个变量 murder 来存储凶手，
凶手从A开始到D结束，逐一判断条件是否成立，在判断时可以用ASCII值 从 65到68 依次表示凶手。找到符合条件的，即为凶手。

#include <stdio.h>
#include <stdlib.h>
int main()
{
	int killer;
	for (killer = 'A'; killer <= 'D'; killer++)
	{
		if (((killer != 'A') + (killer == 'C') + (killer == 'D') + (killer != 'D')) == 3)
			printf("%c", killer);
	}	
	return 0;
}*/
/*

3.在屏幕上打印杨辉三角。
1
1 1
1 2 1
1 3 3 1


#include <stdio.h>
#include <stdlib.h>
int main()
{
	int i, j, k, arr[10][10] = { 0 };//arr[11][11]必须初始化，初始化为{0}
	printf("打印出杨辉三角：\n");
	//1 第一列和对角线的数，均为1，此时第一二行已赋值完
	for (i = 0; i < 10; i++)
	{
		arr[i][0] = 1;
		arr[i][i] = 1;
	}
	//2 分析出杨辉三角排列的规律
	for (i = 2; i < 10; i++)
	{
		for (j = 1; j < 10; j++)
		{
			arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
		}
	}
	//3 打印空格和数字；
	for (i = 0; i<10; i++)
	{
		for (k = 0; k<10 - 1 - i; k++)//行数与空格的关系
		{
			printf(" ");
		}
		for (j = 0; j <= i; j++)//打印数字
		{
			printf("%d ", arr[i][j]);
		}

		printf("\n");
	}
	return 0;
}

*/